## Exercise 2.01a
The names of departments with at least one lecturer, academic titles within each department, and information on the number of modules given within departments and in departments by each group of lecturers (by academic position). Lecturers who do not give any modules should not appear in result table.
Use the ROLLUP grouping.
17 records, 3 columns
Interpret the obtained data:
1. The query returned 4 records for the Department of History. Explain information contained in each record.
2. Note that in the records for the Department of History, two groups have Department of History and NULL in the first two columns. Explain why and what do these NULLs mean.

In [ ]:
query = """
"""
run_sql(query, "2.01a")

## Exercise 2.01b
Using the GROUPING function return information which fields are used for grouping in every record.
17 records, 5 columns
Interpret the obtained data:
1. In some fields resulting from the GROUPING function, number 1 appears, in others 0 – explain these results.
2. In the last record, there are two ones in the fields resulting from the GROUPING function – explain information contained in this record.

In [ ]:
query = """
"""
run_sql(query, "2.01b")

## Exercise 2.01c
Modify the query by displaying information about the fields used for grouping using the GROUPING_ID (instead of GROUPING) function.
17 records, 4 columns
In five records in the field resulting from the GROUPING_ID function the number is 1, in one record the number is 3, in the rest 0.
Interpret the obtained data:
1. In the last record, the field resulting from the GROUPING_ID function contains the number 3. Explain why.
2. Write a query that returns the number of records in the modules table. Answer the question: why is the number of records in the modules table (26) different from the number of modules returned in the last record of the previous query (20)?

In [ ]:
query = """
"""
run_sql(query, "2.01c")

## Exercise 2.02a
The numbers of groups to which at least one student is enrolled, the names of modules for which students are enrolled, and information on the number of students in each group separately enrolled for individual modules. The query should also select information on students not belonging to any group.
88 records.
First NULL Advanced Statistics 1
Second-to-last: ZZIe2003 NULL 2
Last: NULL NULL 94
Interpret the obtained data:
1. The first 15 records in the group_no field contain the NULL value. Explain why.

In [ ]:
query = """
"""
run_sql(query, "2.02a")

## Exercise 2.02b
Modify the previous query so that it
1) includes students who are not enrolled in any modules
2) returns the result of the GROUPING_ID function (name the column grp_id). Explain the meaning of the numbers 0, 1, and 3 in the column containing the result of this function.
96 records.
First: 0, NULL, NULL, 0
Last: 3, NULL, NULL, 94

In [ ]:
query = """
"""
run_sql(query, "2.02b")

## Exercise 2.02c
Modify the previous query so that it returns only records that have the number 1 in the grp_id field.
Tip: use HAVING clause.
13 records
Interpret the obtained data:
1. Write a query that returns information about the number of DIFFERENT groups in the students table.
The query returned the number 12. The query returning records that have the number 1 in the grp_id field returned 13 records. Explain why.

In [ ]:
query = """
"""
run_sql(query, "2.02c")

## Exercise 2.03
Names of academic degrees/titles, names of departments, and information on how many hours each group of lecturers (with the same degree/title) has within each department. Use the GROUPING_ID or GROUPING function.
17 records.
Associate professors have a total of 115 hours of modules
doctors: 87
full professors: 68
masters: 129
Interpret the obtained data:
1. In the first two records, the acad_position field is NULL, and in the department field, the first record contains Department of History and the second contains NULL. Explain why.

In [ ]:
query = """
"""
run_sql(query, "2.03")

## Exercise 2.04a
The sum of payments made by each student group in individual years, by each group, and in individual years. Use CUBE and the GROUPING_ID function. Sort the data by the column containing the result of the GROUPING_ID function and the group number.
Hint: to read the year from the date, use the function: YEAR(date_of_payment)
32 records
First two:
0, NULL, 2018, 14100
0, NULL, 2019, 2290
Last: 3, NULL, NULL, 70820
Explain the information contained in:
1. The first two records
2. The records, in which the result of the GROUPING_ID function is equal to 2
3. The records where the payment year is NULL
4. The last record

In [ ]:
query = """
"""
run_sql(query, "2.04a")

## Exercise 2.04b
Modify the above query by swapping the fields used in GROUP BY and the GROUPING_ID function, and change also the order in which these fields are displayed in the SELECT clause.
Sort the data by the result of the GROUPING_ID function and then by the year of the payment date.
32 records
First: 0, 2018, NULL, 14100
Interpret the obtained data:
1. There are two records in the query result table where the result of the GROUPING_ID function is 1. Explain what they contain.
2. Explain what the records mean where the result of the GROUPING_ID function is equal to 2.

In [ ]:
query = """
"""
run_sql(query, "2.04b")

## Exercise 2.05a
Average grade and the number of grades for each module, for each group and academic_position. Join all tables using INNER JOIN. Use CUBE.
Sort the data by the result of the GROUPING_ID function and then by all fields used for grouping.
142 records
Answer the questions:
1. Which group has the highest average mark in Computer Network Devices? In which record can this information be found?
2. What is the average grade in Statistics, and in which record is this information found?
3. What is the average for the ZZIe2002 group and in which record is this information found?
4. Which group of lecturers gave the highest average rating? Which group gave the highest number of ratings? In which records can this information be found?
5. The data in the query result table shows that 44 grades were issued (find this information). On the other hand, there are 58 records in the student_grades table. Why is there such a difference?

In [ ]:
query = """
"""
run_sql(query, "2.05a")

## Exercise 2.05b
Modify the query so that it returns information about all assigned grades.
NOTE: Not all INNER JOINs in the query should be replaced with LEFT (or RIGHT) JOINs. Also consider the order of the joins.
172 records
Answer the questions:
1. Interpret the information contained in the records where all: module_name, group_no, and acad_position are NULL (there are four such records).
2. Verify whether the number of all grades in result table is the same as the number of records in the student_grades table (58).

In [ ]:
query = """
"""
run_sql(query, "2.05b")